<pad>
<unk>
1
16
18
2019
230m2
7
9
a
about
above
access
accessories
accident
across
acting
add
adults
advertise
advertisement
after
afternoon
against
agency
agoda
agricultural
ahead
air
aircraft
airplane
airport
aisle
aisles
aligning
all
alley
allowed
alone
along
alongside
already
also
altar
ambulance
american
among
amusement
an
ancient
and
anf
anfd
angle
animal
announcement
announcing
answering
anthem
anthropomorphic
antique
antiques
antiquities
anything
ao
aodai
apartment
appear
apple
apples
apricot
april
apron
aprons
aquarium
arch
are
area
arm
arms
around
arrangement
arranges
arranging
art
articles
artifact
artifacts
arts
artworks
as
asking
assisting
assorted
at
attached
attending
attic
attraction
autumn
avenue
avocado
avocados
awarded
away
ba
baby
back
background
backpack
backpacker
bag
bags
bakery
balconies
balcony
ball
ballons
balloon
balloons
balls
bamboo
banana
bananas
band
bandana
bang
banh
banister
bank
banknotes
banner
bar
barrel
barrels
barrier
barriers
basins
basket
baskets
bathroom
baton
baubles
bawls
bay
be
beach
beams
bean
bear
bearers
because
bed
beds
bee
beef
been
beer
before
behind
behing
beige
being
bell
bells
belly
belong
belongs
below
belt
ben
bench
benches
bending
beret
beside
between
beverage
beverages
bicycle
bicycles
big
bike
bikes
bill
billboard
billboards
billing
bills
binoculars
biological
bird
birdcage
biscuit
bitter
bittermelon
black
blisters
block
blockhouse
blocking
blonde
bloosoms
blossom
blouse
blowing
bludgeons
blue
board
boat
boats
bodice
body
bone
bones
book
books
bookshelf
bookshop
bookstore
booth
booths
boots
border
botanical
both
bottle
bottles
bottom
bougainvillea
bought
bouqet
bouquet
bouquets
bow
bowl
bowls
box
boxes
boy
boys
bracelet
bracelets
branch
branches
bread
breads
brick
bricks
bridal
bridge
bridges
brigde
brimmed
bringing
broadly
brocade
bronze
broom
brooms
broth
brown
browsing
bubble
bubbles
bucket
buddha
buffalo
build
building
buildings
built
bulb
bulbs
bulletin
bunch
bunches
bundle
bundles
buoys
burden
burning
bus
bushes
business
bustling
busy
but
butcher
buy
buying
buys
by
ca
cabbage
cabbages
cabinet
cable
cactus
cactuses
cafe
cafes
café
cage
cages
cake
cakes
calculate
calculating
calculator
calf
called
camcorder
came
camera
campus
can
candies
candy
cannon
cannons
cannot
canoe
canoeing
canoes
canopy
cans
cantaloupe
canvas
cao
cap
caps
car
care
cargo
carriage
carrier
carries
carrot
carrots
carry
carrying
cars
cart
carton
cartons
carts
carved
case
cashier
cashiers
cassava
castle
cat
catch
catching
categorizing
cau
caught
caused
cave
ceiling
cell
cellphone
censer
center
centre
ceramic
ceramics
ceremony
certificate
certificates
chair
chairs
chandelier
channel
characters
charge
charging
chase
chayote
check
checkered
checking
checkout
checkpoint
cheek
cheerful
cheering
cheese
chest
chewing
chi
chicken
chickens
child
childr
children
chili
chilli
chillies
chilren
chin
china
chinese
chirstmas
chirt
choice
chooeses
choose
choosing
chopsticks
chosen
christmas
church
cigarette
circles
circular
citadel
city
clapping
class
claus
cleanig
cleaning
cleanser
clear
clerk
clients
cliff
climbing
clinic
cloak
clock
close
closed
closet
closure
cloth
clothes
clothing
clouds
cloudy
clusters
coach
coaches
coat
coated
coats
coconut
coconuts
code
codes
coffee
coffin
collapsed
collar
collected
collecting
collection
color
colors
come
comes
comics
coming
common
company
compiling
complex
composed
computer
comrades
concert
condisering
conditioner
conditioners
conducting
confectionery
conference
confetti
conical
considering
consist
consists
constructing
construction
consult
consulted
consulting
contain
contained
container
containers
containing
contains
content
control
controlling
convenience
cookie
cookies
cooking
cool
coracle
corner
corridor
cosmetics
costume
costumes
cot
cotton
counselling
counter
counters
counting
countries
countryside
couple
court
courtyard
cover
covered
covid
cow
cowman
crab
crafts
cranes
crater
cream
creating
creature
cross
crossbody
crossing
crowd
crowded
crown
cruise
cucumber
cup
cups
curb
curing
currently
customer
customers
cutlery
cutting
cyan
cycler
cycling
cyclist
cyclo
cyclos
cylinder
dai
dairy
dais
dance
dancing
dark
days
daytime
deacorate
dealing
decorated
decorating
decoration
decorations
decorative
deliver
delivery
department
depicts
deserted
design
designed
desk
destination
destintion
device
dial
dials
diapers
different
diner
dinh
dining
dinner
dinosaur
dip
dipping
direction
disabled
discussing
dish
dishes
dishwashing
disinfectant
display
displayed
displaying
displays
distance
distributing
district
diving
do
docked
docking
doctor
doctors
document
does
doesn
dog
doing
doll
dominant
door
doors
dot
dots
dotted
down
downstairs
downwards
dragon
dragonfruits
draw
drawing
drawings
drawn
draws
dress
dressed
dresses
dressing
dried
drifting
drink
drinking
drinks
driver
drivers
drives
driving
drop
drugstore
drum
drumming
drums
dry
duck
dummy
durian
duty
dyes
dynasties
e
each
ear
early
eat
eatery
eating
eats
eco
economy
ecotourism
edge
egg
eggs
eight
either
elder
electric
electrical
electronic
electronics
elementary
elephant
elephants
else
emit
emits
employee
employees
empty
end
endless
enjoying
ensemble
enter
entering
entertainment
entrance
entrances
entries
entry
envelopes
epitaph
equipment
equipped
erected
escalator
ethnic
evening
event
everybody
everyone
excess
excursion
exercise
exercising
exhaust
exhibit
exhibited
exhibiting
exhibition
exhibits
existing
explanations
eye
eyeglasses
fabric
fabrics
facades
face
faces
facial
facing
fair
fairground
falling
families
famous
fan
fans
far
farmer
fashion
fast
features
feeding
feet
female
fence
fences
ferries
ferry
ferrying
ferrys
festival
field
fields
fighting
figure
figures
fill
filled
filming
fire
firearm
firefighters
first
fish
fishing
fitness
five
fixing
flag
flagpole
flagpoles
flags
flamboyant
flapping
flat
flies
flights
flip
floating
flooded
floor
floors
flops
floral
florist
flower
flowerbed
flowers
flowery
flying
foam
following
food
foot
footpath
footwear
for
forbidden
foreign
forest
fork
fort
forward
fossil
fossils
fountain
four
fourth
frame
freezer
fresh
fridges
friend
friends
from
front
frony
frozen
fruit
fruits
full
fully
functionaries
fur
gallery
game
garage
garbage
garden
gardens
garlic
gas
gate
gates
gathered
gathering
gazing
gear
gel
gell
gels
get
getting
giam
gift
gifts
girl
girlfriend
girls
give
given
gives
giving
glass
glasses
glove
gloves
glowing
glutamate
go
goat
gods
goes
going
gold
golden
goods
gossip
gourd
grand
grape
grapefruits
grapes
grass
gravestone
gray
green
greeting
grey
grilled
grilling
grinders
groceries
grocery
ground
group
groups
grown
guard
guarding
guards
guests
guide
guiding
guitar
gum
guy
ha
had
hair
haired
hairgrip
hairpin
hairstyle
hall
halter
hammock
hand
handbag
handicrafts
handing
handle
handlebars
handles
handling
handrail
hands
handwash
hang
hanged
hanging
happily
happy
harbour
harvesting
has
hat
hats
have
having
hawker
hawking
he
head
heading
headlights
headphone
headphones
headset
health
heavily
heels
height
held
helicopter
helicopters
helmet
helmets
helped
helping
her
herbs
herding
here
hher
hide
high
higher
highest
hill
him
hip
hips
his
historic
historical
history
hiving
ho
hoe
hoeing
hoi
hold
holding
holds
holes
holiday
home
hood
hooks
horizontal
horse
hoses
hospital
hospitals
hot
hotpot
house
household
houses
houseware
housewares
hue
hugging
hunching
hung
hut
huts
i
ice
icon
icons
if
images
in
inaugurate
incense
includes
independence
information
informations
ingredients
injecting
ink
inner
inox
inside
inspecting
installed
installing
instant
institution
instructing
instrument
instruments
intend
intending
interface
interior
interview
interviewing
into
introduce
introduced
introducing
inventory
iridescent
iron
irrigation
is
islands
isolation
it
item
items
its
jacket
jam
jars
jean
jeans
jecket
jewelleries
jewelry
jogging
joining
joss
juice
jungle
just
karaoke
keep
keeping
keychain
khen
kid
kids
kinds
kiss
kissing
kitchen
kitesurfing
knee
knickers
knife
kumquat
kumquats
la
ladder
ladders
ladies
ladle
lady
laid
lake
lakes
lakeside
lamp
lamppost
lampposts
lamps
landing
lane
lanes
lantern
lanterns
laptop
large
largest
late
latern
laterns
laughing
lawn
layers
laying
lead
leading
leads
leaf
leaning
leans
leather
leaves
lecturing
led
left
leftmost
leg
lemon
letters
level
lies
life
lifting
light
lightbulb
lightbulbs
lighting
lights
lily
lime
line
lines
lining
lion
lions
lipstick
liquid
liquor
listen
listening
literature
little
living
loaded
loading
loaf
loaves
lobby
located
locomotive
loft
logo
long
look
looking
looks
lot
lots
lottery
lotus
lotuses
loudspeaker
lower
lucky
lunar
lychee
lychees
lying
lựa
machine
machines
made
mailbox
main
mainly
making
male
mall
mammonish
man
management
mango
mangrove
manholes
manipulating
mannequins
many
map
marching
marine
marker
market
markings
martyrs
mascot
mask
masks
massage
mat
material
materials
mattress
mau
mausoleum
mc
means
measured
measurement
measuring
meat
meats
median
medical
medicine
meeting
member
members
memorial
men
menu
menus
merchandise
merit
metallic
mi
mic
micro
microphone
microphones
mid
middle
military
militiaman
milk
mills
minh
mini
minorities
minority
mirror
mirrors
miss
mobile
model
modelled
models
money
monitoring
monk
monosodium
monument
moon
morning
moss
mostly
mot
motobikes
motor
motorbike
motorbiked
motorbikes
motorcycle
motorcycles
mountain
mountainside
mounted
mouth
mouths
move
moving
mug
mummy
museum
mushrooms
music
musical
nail
name
nameplate
narrating
narration
narrow
national
navigating
navy
near
nearby
neck
neighborhood
new
newspaper
newspapers
next
night
no
nobody
noel
noi
non
none
noodle
noodles
noon
noone
not
notes
nothing
notice
now
nthe
number
numbers
nurses
oar
objects
observe
observing
occasion
occupied
ocean
octopus
of
off
offer
offering
officer
offshore
oil
old
omelette
on
one
ones
onions
only
onto
onw
open
opened
opening
opposite
or
orange
oranges
orchard
order
ordering
organization
organizing
ornamental
ornaments
os
other
out
outdoor
outer
outermost
outerwear
outfit
outfits
outside
outwards
over
overcoat
owned
owner
pack
package
packages
packaging
packet
packing
packs
paddle
paddler
paddling
paddy
pagoda
paint
painted
painting
paintings
paints
pair
pajama
pajamas
paklov
palace
pamper
pancakes
panel
pans
pant
pants
paper
papers
parachute
parallel
paramedics
parasailing
parasols
parents
park
parked
parkedd
parking
part
participate
participating
partition
pass
passenger
passengers
passers
passes
passing
past
pastel
path
paths
patient
patients
patio
pattern
patterned
patterns
pavement
pay
paying
payment
peach
peacock
peddler
peddlers
peddling
pedestal
pedestrian
pedestrians
pedlar
peeling
pen
peole
people
peppers
performance
performers
performing
person
personal
peson
pharmacy
pho
phoenix
phone
phones
photo
photographed
photographer
photographing
photos
phototgraph
pick
picker
picking
pickup
picture
pictures
piece
pigeons
pile
pillars
pillows
pine
pineapple
pineapples
pink
pinned
pipe
pitaya
pitches
pitching
pith
place
placed
places
plain
planes
plant
planted
planting
plants
plastic
plastics
plate
plates
play
playground
playing
plow
podium
poducts
point
pointed
pointing
pole
poles
police
policeman
policemen
polka
pond
pool
poolside
porcelain
porch
pork
portrayed
portraying
portrays
pose
poses
posing
position
post
postcard
postcards
posters
posture
pot
potato
pots
potted
pouring
powder
powdered
power
praying
prehistoric
prepare
prepared
preparing
present
presentation
presented
presenting
presents
press
pressing
pretty
price
primarily
printed
produce
product
products
program
prohibiting
prohibition
project
promoting
promotion
propped
protective
provided
province
pub
public
pull
pulling
pump
pumpkin
pumps
punt
punts
purchased
purple
purse
push
pushed
pushing
put
putting
pyjamas
qr
quarantine
quarter
queue
queuing
quick
quiet
quite
quoc
rabbit
race
racing
rack
rad
rail
railing
railings
railroad
railway
railwayside
rain
raincoat
raining
raised
raising
rambutan
rambutans
raw
reach
reaching
read
reading
ready
reality
rearranging
rearview
receipt
receive
receiving
recently
reception
reciept
reclining
recording
recreational
rectangle
rectangular
red
region
registration
reindeer
relatives
relic
relics
remembrance
repairing
representing
resort
restaurant
resting
restricted
restructure
returning
reviewing
ribbon
ribbons
rice
rickshaw
ride
rider
riders
riding
right
rightmost
rigth
ring
rise
river
riverbank
riverside
road
roadside
roadway
rock
rocks
roll
rollaway
roof
roofs
rooftop
room
rose
rostrum
round
roundabout
row
rowing
rows
rua
rubber
ruby
run
running
rural
s
sailing
sails
sale
sales
sall
salon
same
sample
samples
sand
sandals
santa
sauce
sausage
sausages
saxophone
scaffolding
scales
scaling
scan
scanner
scanning
scarf
scarve
scarves
scence
scene
scenery
school
schoolyard
scientific
scissors
scooping
scooter
scooters
scorching
scrolling
sculpted
sea
seafood
seagoing
seaport
seashore
seaside
seasoning
seat
seated
seaway
second
section
security
sedan
see
seems
selecting
selfie
sell
selling
sells
separate
seriously
serve
served
service
serving
servings
sesban
set
sets
seven
sewing
shade
shading
shadow
shaking
shampoo
shape
shaped
shawl
she
sheet
shelf
shelves
shield
shining
ship
shipper
ships
shirt
shirts
shite
shoe
shoes
shop
shopkeeper
shopping
shops
shopw
shore
short
shorts
shoulder
shovel
show
shower
showing
shows
shrimp
shrimps
shrine
shumai
side
sides
sidewalk
sidewalks
sightseeing
sign
signboard
signpost
signs
silk
silver
silvery
similar
singing
sink
sip
sit
site
siting
sits
sitting
situated
six
size
skeleton
skeletons
skirt
sky
slats
sleeping
sleeve
sleeved
slices
slicing
sliding
slightly
slippers
small
smart
smartphone
smartphones
smiling
smoking
snack
snacks
snails
snake
sneakers
snow
snowboarding
snowflakes
snowman
sofa
soft
softener
sold
soldier
soldiers
some
someone
something
sorting
soup
south
souvenir
souvenirs
soy
space
speak
speaker
speaking
specializes
specimen
specimens
speech
sphere
spices
splashing
sponge
spontaneous
spoon
sports
spot
spray
spraying
spreading
spring
sprouts
square
squares
squatting
stack
stacked
stacking
staff
staffs
stage
stainless
stair
staircase
stairs
stairway
stalks
stall
stalls
stand
standing
stands
star
stars
state
station
statue
statues
staying
steel
steps
stick
sticked
sticking
sticks
sticky
stilt
stilts
stocks
stomach
stone
stool
stools
stopping
stops
store
stores
storey
storeys
stories
stream
street
streets
stretch
stretched
string
stripe
striped
stripes
stroking
stroller
structure
student
students
studying
stuff
stuffed
stuffs
styrofoam
sugar
sugarcane
suit
suitcase
suitcases
sun
sundshade
sunglasses
sunny
sunset
supercar
supermarket
supplies
support
surface
surfboard
surfing
surrounding
sushi
sweater
sweeping
sweet
sweets
swimming
swimsuit
swing
swinging
swings
symbol
syringe
system
t
table
tablecloth
tables
tablet
tag
take
taken
takes
taking
talk
talking
tall
tallest
tangerines
tank
tape
taped
tattoo
taxi
te
tea
teachers
teacu
team
teapot
teddy
telephoning
temperature
temple
ten
tending
terraced
test
tested
testing
tet
text
th
thanh
that
thatched
the
their
them
there
these
they
things
thinking
third
this
those
three
through
thê
tickets
tie
tiered
tiers
ties
tiled
tiles
time
tiptoe
to
together
toilet
tomato
tomatoes
tone
top
topic
topless
tops
total
tote
tour
tourism
tourist
tourists
toward
towards
towel
towels
tower
towers
towing
town
toy
toys
track
trade
trading
traditional
traffic
train
transformer
transport
transportation
transported
transporting
trash
trashcans
travel
traveling
travelling
travels
trawl
tray
trays
treadmills
tree
trees
treet
tribune
trollet
trolley
trolleys
trolly
tropical
trousers
truck
trucks
trunks
trying
tu
tubers
tug
tunnel
turbines
turn
turning
turquoise
tv
tvs
twilight
twin
two
tying
type
types
typing
umbrella
umbrellas
uncle
unclouded
uncrowded
under
underground
underneath
undersea
underside
underwater
unicorn
unicorns
uniform
uniforms
unmasked
unoccupied
unused
up
upper
upstairs
use
used
uses
using
utensils
vaccine
various
vase
vegestable
vegestables
vegetable
vegetables
vegetale
vehicle
vehicles
vending
vendor
vendors
vermicelli
vertical
very
vessels
vest
vial
vietnam
vietnamese
view
viewing
village
violet
virtual
visit
visiting
visitors
visits
volleyball
voltage
vote
votive
waist
wait
waiter
waiters
waiting
walk
walkin
walking
walks
wall
wallet
walls
wan
wandering
want
wants
war
wares
warship
was
washing
wastebasket
watch
watches
watching
water
watering
watermelon
watermelons
way
we
weaing
weapon
wear
wearing
wears
weather
wedding
weighing
welcome
well
west
whale
what
whe
where
which
while
white
whithout
who
whom
whose
wide
wind
windmill
window
windows
wine
wings
winnowing
wireless
wires
witch
with
without
woman
women
wood
wooden
woods
word
words
work
worker
workers
working
workplace
works
worm
worn
worshiping
would
woven
wrapped
wrist
writing
yard
year
yellow
yet
yogurt
yoke
you
young
youth
zero
zone