<pad>
<unk>
"
'
,
-
1
16
18
30
>?
?
??
a
abenues
about
above
accident
according
across
action
active
activities
activity
adult
adults
advertise
advertisement
advetisement
advised
after
against
agency
agoda
agricultural
ahead
air
aircraft
airplane
aisle
aisles
aldults
aligning
all
alley
allowed
almost
alone
along
alongside
already
altar
ambulance
among
an
ancient
and
animal
animals
announcement
anthropomorphic
antique
any
anyone
anything
ao
appear
apples
apricot
apron
arch
are
area
arm
armchairs
arms
around
arrange
arranged
arrangement
arranging
arriving
arrow
art
artefacts
artifact
artifacts
as
assistant
assistants
at
attached
attendant
attending
attic
attired
attraction
avenue
avoid
awarded
ba
babies
baby
back
background
backpack
backpacker
backs
bag
bags
bakery
balconies
balcony
bald
ball
balloon
balloons
balls
bamboo
banana
band
banh
banister
banner
banners
bao
bar
barricade
barricades
barrier
barriers
basins
basket
baskets
bathing
bathroom
baubles
be
beach
beams
bean
beanie
bearers
bed
beds
been
beer
before
beginning
behind
beige
being
bell
bells
belong
below
belt
bench
benches
beret
beside
besides
between
beverage
bicycle
bicycles
big
biggest
bike
bikes
biking
bikini
bill
billboard
billboards
bills
binoculars
bird
birdcage
biscuits
bittermelon
black
block
blockhouse
blocking
blonde
bloomed
blossom
blossoms
blouse
blue
board
boards
boat
boatman
boats
bodice
body
book
books
bookshelf
bookstore
booth
booths
boots
botanical
both
bottle
bottles
bottom
bought
bouquet
bouquets
bow
bowing
bowl
bowls
box
boxes
boy
boys
bracelet
branch
branches
brands
bread
breads
brick
bricks
bride
bridge
bridges
bring
bringing
broom
brooms
broth
brought
brown
browsing
bucket
buddha
buffalo
buffaloes
build
building
buildings
built
bulb
bulbs
bulletin
bunch
bundles
burden
burn
burner
bus
buses
business
but
butcher
buy
buyers
buying
by
cabbage
cabbages
cabinet
cactuses
cafe
café
cage
cages
cake
cakes
calculate
calculator
called
camcorder
came
camera
cameras
camisole
can
candies
candy
cannon
canoe
canoeing
canoes
cans
cantonese
canvas
cap
caps
captured
car
care
cargo
carriage
carried
carrots
carry
carrying
cars
cart
carton
cartons
carts
carved
cashier
cashiers
castle
cat
ceiling
celebrate
cell
cellphone
censer
center
centre
ceramics
ceremony
certificate
certificates
chair
chairs
chandelier
character
charge
charged
charging
chatting
chayote
checkered
checking
checkout
cheering
chest
chests
chi
chicken
child
children
chili
chill
chilli
chin
chinese
chirstmas
choice
choose
choosen
choosing
chopsticks
chose
chosen
christmas
church
circle
circles
circular
citadel
city
clapping
claus
cleaned
cleaning
climb
clinic
clock
clocks
close
closed
closest
closet
closthes
cloth
clothes
clothing
clowns
club
clusters
coaches
coast
coat
coats
cockpit
coconut
coconuts
code
coffee
collar
collars
collecting
color
colorful
colors
colro
come
coming
commercials
commodities
commodity
companion
company
compared
comparison
compartment
compartments
computer
comrades
concentrating
condiment
condition
conditioner
conditioners
conditions
confectionery
conference
conical
consist
constructed
constructing
construction
consulted
consulting
contain
contained
container
containers
containing
content
continue
control
controling
controllers
controlling
convenience
conversing
cooker
cookie
cookies
cooking
coracle
coriander
corner
corridor
cosmetic
cosmetics
cosplay
costume
costumes
counter
counters
counting
country
couple
court
courtyard
cover
covered
covering
cow
cows
crab
craftsmen
cranes
crater
cream
creatures
crops
cross
crossbody
crossing
crowd
crowded
crowds
crown
crushed
cubic
cucumber
cup
cups
curb
curing
currently
curtain
cushion
customer
customers
cutlery
cutting
cyan
cycler
cycling
cyclist
cyclists
cyclo
cycloes
cyclos
cylindrical
dai
dais
dance
dancing
dark
dat
date
daughter
day
decor
decorate
decorated
decorating
decoration
decorations
decorative
deep
defense
delegates
deliver
delivering
delivery
department
depict
design
designed
desk
destination
device
dials
diamond
diapers
did
different
dine
diners
dining
dip
direction
directions
directly
dired
dirt
discount
dish
dishes
disinfect
disks
display
displayed
displaying
distance
distributed
district
ditch
do
docked
docking
doctor
doctors
does
dog
doing
doingg
dominant
don
done
door
doors
doorway
dot
dots
down
dragon
draw
drawed
drawing
drawings
drawn
dress
dressed
dresses
dressing
drifting
drink
drinking
drive
driven
driver
drivers
driving
drugstore
dry
dummies
duty
dyed
each
ear
earphones
ears
eat
eatery
eating
eaves
egg
eggs
either
elder
elderly
electric
else
emit
emotion
employee
employees
empty
end
engaged
enjoying
entering
entrance
entrances
entries
envelope
equip
equipment
equipped
erect
erected
escalator
essential
ethnic
event
events
everone
every
everyone
examination
except
exercise
exercising
exhibit
exhibited
exhibiting
exhibition
exhibits
existing
expresison
expressing
expression
expressions
exterior
eye
eyeglasses
eyes
fabric
facade
face
faces
facial
facing
fair
falling
families
family
fan
fanny
fans
far
farmer
farmers
fashion
feature
feeding
feeling
feelings
feet
female
females
fence
ferry
ferrying
ferrys
festival
field
fields
figures
figurines
fill
filled
find
fire
firearm
fireplace
first
fish
fishes
fishmongers
five
fixing
flag
flagpole
flagpoles
flags
flapping
flask
flat
flied
flights
flip
floating
flocking
floor
floors
floppy
flops
floral
flower
flowers
flowery
flowwers
flying
foam
following
food
foot
for
form
forward
found
fountain
four
fout
frame
frames
freezer
fresh
fridges
friend
friends
from
front
frony
fruit
fruits
functionary
fur
furniture
gallery
game
garage
garbage
garden
gardens
garlic
garment
gas
gate
gatekeepers
gates
gather
gathered
gathering
gear
general
get
getting
gift
gifts
girl
girlfriend
girls
girt
give
given
giving
glass
glasses
glazed
globe
glove
glowing
go
goat
gods
goinf
going
golden
goods
gproducts
grab
grape
grass
gravestone
gray
green
greet
greeting
grey
grill
grilling
grinders
grocery
ground
group
groups
grow
growing
grown
grows
guard
guarding
guards
guest
guests
guidance
guide
guiding
guitar
guy
guys
h
haging
hair
haired
hairgrip
hairpin
hairstyle
hall
hallway
hammock
hand
handbag
handheld
handle
handlebar
handlebars
handles
handling
hands
hang
hanged
hanging
happened
harbour
harvesting
has
hat
hats
have
having
hawker
he
head
heading
headlights
headphones
heads
heels
height
held
helicopter
helmet
helmets
helping
helps
her
here
heterosexual
high
higher
highest
hiking
him
himself
hips
his
historical
ho
hoe
hoisted
hold
holder
holding
holds
hole
holiday
hoods
horizontal
horizontally
horse
hoses
hot
hotel
hotpot
house
household
households
houses
how
hugging
hulls
human
hung
huts
ice
icon
icons
identified
if
illuminated
images
in
incense
included
indicate
ingredient
ingredients
ink
inner
innermost
inox
inside
installed
installing
instant
instrument
instruments
intend
intending
interface
intersection
interviewing
into
introducing
iron
is
isolation
it
item
items
its
jackect
jacket
jackets
jackfruit
jars
jeans
jelly
jewelleries
jewellery
job
jogging
joss
jumping
just
keeping
keychain
keychains
kid
kids
kind
kinds
kitchen
kite
knee
kneel
kneeling
knickers
knife
knives
korean
ky
la
ladder
ladies
lady
laid
lake
lakeside
lamp
lampposts
lamps
land
landing
landscape
lane
lanes
lantern
lanterns
laptop
large
largest
last
lawn
lay
layers
laying
lead
leader
leading
leads
leaf
lean
leaning
leaves
led
left
letters
level
license
lie
lies
life
lifting
light
lightbulb
lighting
lights
like
lime
line
lines
linh
lining
lion
lipstick
lit
little
living
loading
loafs
loaves
lobby
locality
located
locating
location
locomotive
logo
long
look
looking
looks
lot
lottery
lotus
loudspeaker
lower
lowest
lychee
lying
machine
machines
made
magnifying
mailbox
main
mainly
making
male
mall
mammonish
mammoth
man
manhole
manis
mannequin
mannequins
mansion
many
market
markets
markings
mascot
mask
masked
masks
material
materials
mattress
mc
meal
mean
means
measurement
meat
media
median
medical
medicine
meet
meeting
member
men
mention
menus
merit
mic
micro
microphone
microphones
mics
middle
military
militia
militiaman
militiamen
milk
mill
mills
minh
minority
mirror
mnay
mobile
model
modelled
models
money
monks
monument
moon
more
moss
most
mostly
motor
motorbiek
motorbike
motorbikes
motorcycle
motorcycles
motorcyclists
mounted
mouth
mouths
move
movement
moving
mug
museum
musical
must
nail
name
named
nameplate
narrate
national
navy
near
nearby
necessary
neck
needles
neighborhood
newspapers
next
nhu
night
no
noi
non
noodle
noodles
not
notebook
notebooks
notice
now
number
numbers
oar
object
objects
ocassion
occasion
occupied
ocean
of
off
offer
officer
officers
offshore
oil
old
on
one
ones
onion
only
onto
open
opened
opening
openned
oposite
opposite
or
orange
orchard
orchards
order
organizing
ornaments
other
others
out
outdoor
outer
outermost
outerwear
outfit
outfits
outside
over
overcoat
overhead
owner
owners
pack
packaging
packs
paddle
paddler
paddles
paddling
pagoda
paining
paint
painted
painting
paintings
paintinings
pair
pairs
pajamas
paklov
palace
pancakes
panel
pant
pants
paper
parachutes
paramedics
parasailing
parasols
park
parked
parking
participating
pass
passenger
passengers
passers
passersby
passing
pasted
path
paths
patience
patient
patio
pattern
patterns
paved
pavement
pay
paying
payment
peach
peddler
peddlers
pedestal
pedestrian
pedestrians
pedlar
pen
pens
peopl
people
peoples
pepper
performance
performers
performing
person
persons
pet
pharmacy
pho
phoenix
phone
phones
photo
photograph
photographed
photographing
photopraphed
photos
phototgraph
phu
pick
picking
pickup
picture
pictures
piece
pigeons
pile
piled
pillar
pillars
pillion
pillow
pillows
pin
pine
pineapples
pink
pinned
pitches
pith
placards
place
placed
placing
plaid
planes
planning
plant
planted
plants
plastic
plate
plates
platform
play
playing
plaza
podium
point
pointing
pole
poles
police
policeman
policemen
polka
polo
pond
pool
porcelain
porch
porridge
porter
portion
portray
portrayed
portraying
pose
posing
position
post
posted
poster
posterior
posters
posts
posture
postures
pot
potato
potatoes
pots
potted
pour
poured
powder
power
prepare
prepared
present
presented
presenting
preserved
press
pressing
price
prices
primarily
print
printed
produce
product
products
program
prohibit
project
promotion
properties
propped
protective
provided
province
pub
pull
pulling
pump
pumps
punt
purchase
purchased
purple
purpose
purse
push
pushed
pushing
put
puts
putting
qr
quantity
quarter
queue
rabbit
race
rack
rail
railing
railings
railroad
railway
rain
raincoat
raincoats
raise
raised
raising
rambutans
raw
reach
reaching
reading
rear
rearview
received
receiving
reception
recipients
reclining
recorded
recording
recored
red
region
reindeer
related
relative
relics
repair
repairing
repairman
repertoire
represent
representing
resort
rest
restaurant
restaurants
ribbon
ribbons
rice
ridden
ride
rider
riders
riding
right
rightmost
river
rivers
road
roadside
roadway
rock
rocks
roll
rolls
roof
roofs
rooftop
room
rop
rope
ropes
rostrum
roundabout
route
row
rower
rowers
rowing
rows
rubber
rules
run
running
runnng
s
sack
sacks
saddle
sail
sailing
sails
sale
saleswoman
salon
same
sampled
samples
sand
sandals
santa
sauce
scaffolding
scale
scales
scarf
scarves
scene
scenery
scenes
school
scissors
scoop
scooping
scooter
scooters
screen
sculpted
sea
seafood
seaport
seashore
season
seasoning
seat
seated
seating
seats
second
section
security
see
seen
select
selecting
self
selfie
sell
seller
sellin
selling
sells
separate
separatedly
served
serving
servings
set
sets
sewing
shade
shadow
shampoo
shape
shaped
shawl
she
sheet
shelf
shelves
shield
shining
ship
shipped
shipper
ships
shirt
shirts
shite
shoe
shoes
shop
shopkeeper
shopping
shops
shore
short
shorter
shorts
shoulder
show
shower
showing
shown
showroom
shrimp
shrimps
shrine
side
sides
sidewalk
sidewalks
sightseeing
sign
signboard
signs
silk
silver
similar
singing
sink
sip
sit
site
sits
sitting
situated
situation
sixth
skeleton
skeletons
skirt
skirts
skull
sky
skyblue
slats
sleeping
sleeve
sleeved
sliding
slippers
small
smartphone
smiling
sneakers
snowflakes
snowman
socks
sofa
soft
softener
sold
soldier
soldiers
some
something
son
soup
souvenir
souvenirs
space
sparkling
sparsely
speak
speaker
speakers
speaking
special
specialize
specimen
specimens
speech
spoon
spoons
sport
spot
spray
spreading
spring
sprouts
square
squatting
staanding
stack
stacked
staff
staffs
stage
stair
staircase
stairs
stalks
stall
stalls
stand
standing
standings
stands
staniding
star
stars
starting
state
station
statue
statues
status
staying
stepping
steps
stick
sticked
sticks
sticky
stone
stool
stools
stooping
stop
stopping
stops
storage
store
stores
storeys
stove
straight
stratified
stream
street
streets
stretch
stretched
stretching
string
strings
stripe
striped
stripes
stroking
stroller
strolling
structure
structures
strung
student
students
styrofoam
subject
such
sugarcane
suit
sun
sunglasses
sunlight
sunshine
supermaket
supermarket
support
surf
surface
surfboards
surrounded
sushi
sweater
sweep
sweet
swimming
swing
swings
symbol
syringe
t
table
tablecloth
tables
tag
tags
tail
take
taken
taking
talk
talking
tall
taller
tallest
tank
tape
tarp
tarpaulin
tarpaulins
tarps
tattoo
taxi
taxis
tea
teacher
teachers
teacup
team
teams
teapot
teenagers
telephoning
televisions
temperature
temple
tending
terrace
terrains
tet
text
that
thatched
the
their
them
theme
themed
ther
there
these
they
thigh
thing
things
thinh
third
this
those
thoses
thread
three
through
thw
tickets
tie
tied
tiers
tile
tiled
tiles
time
tires
tissue
to
toad
together
tomato
tomatoes
tone
tool
tools
toothbrushes
top
topic
topless
tops
torn
tot
total
touch
touched
touching
tour
touring
tourism
tourist
tourists
toward
towards
towels
tower
towers
towing
town
toy
trade
trading
traditional
traffic
train
transceiver
transformer
transport
transportation
transportations
transported
transporting
transports
trash
trashcans
travel
travelers
traveling
travelling
tray
trays
treating
tree
trees
tribune
trolley
trolleys
trollies
trolly
trollys
trousers
truck
trucks
trunks
tug
turning
turns
tv
two
type
types
typically
umbrella
umbrellas
uncle
under
underneath
underpass
underwater
unicorn
unicorns
uniform
uniforms
unmanned
unoccupied
unopened
unused
up
upper
upstairs
use
used
users
uses
using
vacuum
vai
vase
vegetable
vegetables
vehicle
vehicles
vending
vendor
vendors
vest
vietnamese
view
viewing
village
visit
visiting
visitors
visitting
volleyball
voltage
vote
wading
waist
waiters
waiting
walk
walking
walkway
wall
wallet
walls
want
warriors
was
wash
washing
wastebasket
wat
watch
watched
watching
water
watering
watermelons
way
ways
we
wear
wearing
wears
wearther
weather
wedding
weighing
welcome
well
were
wet
wh
whale
what
wheat
when
wher
where
whhat
which
whie
while
white
who
whom
whose
why
wild
window
windows
wine
wings
winnowing
wires
with
without
woman
women
wooden
words
work
workers
working
workplace
works
worn
woth
would
wow
wrapped
wrist
wrists
write
wrong
wwhat
wwhere
yard
yellow
yoke
you
young
youngers
youngster
your
youth
youths
z
zone
ưhat
